# 나쁜 성분들
p0 = ['티트리', '티트리오일', '설퍼콜로이드', '황']
p1 = ['N-아세틸-L-타이로신', '감추출물', '고수', '다이펩타이드다이아미노부티로일벤질아마이드다이아세테이트', '리보오스', '만주자작나무껍질추출물', '만주자작나무잎추출물', '망가니즈글루코네이트', '모노기나산사추출물', '모창출뿌리추출물', '바이오틴', '바질꽃추출물', '바질잎추출물', '비타민 B1', '비타민 B6', '비타민 H', '삼색제비꽃추출물', '서양고추나물꽃/잎/줄기추출물', '슬리퍼리엘름나무껍질', '슬리퍼리엘름나무껍질추출물', '쓴쑥추출물', '아나토씨추출물', '참갈파래추출물', '카페인', '클레리세이지', '키네틴', '티아민에이치씨엘', '티오다이프로피오닉애씨드', '파디메이트 O', '파파야잎추출물', '페닐에틸레조시놀', '포르피리듐 크루엔툼추출물', '프로방스장미', '프로방스장미꽃', '프로방스장미씨추출물', '호두나무열매껍질추출물', '호두추출물', '화이트네틀', '히비스커스', '히페리쿰추출물', 'UVA', 'UVB', '파라-아미노벤조익애씨드', '파바']
p2 = []
p3 = ['페닐에틸레조시놀']
p4 = ['리조무코르 미에헤이추출물']
p5 = ['N-아세틸-L-타이로신', '기장', '기장추출물', '기장추출물', '다이리놀레익애씨드/프로판다이올코폴리머', '디하이드로에피안드로스테론', '라우릴락테이트', '로얄젤리', '리보오스', '망가니즈글루코네이트', '바나나추출물', '바이오틴', '사탕수수추출물', '서양고추나물꽃/잎/줄기추출물', '소듐하이드록시메칠글리시네이트', '쐐기풀', '쐐기풀추출물', '아이소말트', '아이소세틸살리케이트', '알코올', '와일드얌뿌리추출물', '요구르트', '프라스테론', '호르토니아 플로리분다잎추출물', '흉선하이드롤리세이트', '히페리쿰추출물', '실트', '씨솔트', '포포나무열매추출물', '포포추출물', '난', '난추출물', '비폴렌', '아와푸히', '아와푸히추출물', '토멘틸뿌리추출물', '토멘틸추출물']
p6 = ['알루미나', '알루미늄실리케이트', '탤크', '실트', '버지니아풍년화', '소듐카보네이트', '위치하젤']
p7 = ['매스틱검']
p8 = ['리조무코르 미에헤이추출물', '파파야추출물', '파파인']
p9 = ['네틀추출물', '들깨', '루스쿠스 아쿨레아투스', '만주자작나무껍질추출물', '모창출뿌리추출물', '모하비유카', '모하비유카잎/뿌리/줄기추출물', '바나나추출물', '범부채뿌리추출물', '부처스브룸뿌리추출물', '사발팜열매추출물', '생강', '소시지트리추출물', '슬리퍼리엘름나무껍질', '슬리퍼리엘름나무껍질추출물', '쐐기풀', '쐐기풀추출물', '아줄렌', '요구르트', '유카추출물', '참갈파래추출물', '팬지추출물']
oily_bad = ['트라이글리세라이드','팔미틱애씨드','미리스틱애씨드','스테아릭애씨드','코코넛오일','시어버터','페트롤라툼',
          '벤조페논-3','메톡시신나메이트','에칠헥실메톡시신나메이트']
dry_bad = ['알코올','암모늄라우릴설페이트','암모늄라우레스설페이트','소듐라우레스설페이트','멘톨','페퍼민트']

class I_P: # Input_Problem
    
    def __init__(self, P_list, type_p):
        self.P_list = P_list
        self.type_p = type_p

    def c_p(self):
        print('Error')
        
class C_P(I_P): # Check_Problem
        
    def c_p(self):
        combine_p_list=[]
        
        for P0 in self.P_list:
            if P0 == '트러블성피부케어':
                combine_p_list.append(p0)
            elif P0 == '안티에이징':
                combine_p_list.append(p1)
            elif P0 == '블랙헤드개선':
                combine_p_list.append(p2)
            elif P0 == '다크스팟개선':
                combine_p_list.append(p3)
            elif P0 == '피부톤개선':
                combine_p_list.append(p4)
            elif P0 == '수분공급':
                combine_p_list.append(p5)
            elif P0 == '유분조절':
                combine_p_list.append(p6)
            elif P0 == '모공크기개선':
                combine_p_list.append(p7)
            elif P0 == '피부요철완화':
                combine_p_list.append(p8)
            elif P0 == '피부진정':
                combine_p_list.append(p9)

        if self.type_p == '지성':
            combine_p_list.append(oily_bad)
        elif self.type_p == '건성':
            combine_p_list.append(dry_bad)
            
        return sum(combine_p_list,[])