# 가중치 부여할 좋은 성분들 리스트 (g_number_0 : 훌륭함 , g_number_1 : 좋음)
g0_0=['레티놀', '레티닐레티노에이트', '레티닐아스코베이트', '바위돌꽃뿌리추출물', '바하', '베타-하이드록시애씨드', '벤조일퍼옥사이드', '비타민 A', '삭제', '살리실릭애씨드', '아젤라익애씨드', '아젤렉스', '채널드랙추출물', '카프릴로일살리실릭애씨드', '칸나비디올', '테트라펩타이드-30']
g0_1=['베타인살리실레이트', '석시닉애씨드', '피리독신에이치씨엘']
g1_0=['(아몬드/보리지/아마/올리브)애씨드/글리세라이즈', '3-O-에틸아스코빅애씨드', 'D-알파-토코페롤', 'Ester-C', 'L-아스코빅애씨드', 'Matrixyl 3000', '가시선인장', '가자열매추출물', '감마리놀레닉애씨드', '감초뿌리', '감초뿌리추출물', '감초추출물', '강황(울금)', '고투콜라', '구스베리열매추출물', '구아바', '구아바열매추출물', '국화추출물', '그롬웰', '글라이코프로테인', '글라이콜릭애씨드', '글루코노락톤', '글루코실세라마이드', '글루코실헤스페리딘', '글루타티온', '글리세린', '글리세린', '글리세릴아스코베이트', '글리시레티닉애씨드', '글리시레틱애씨드', '까무까무열매추출물', '까무까무열매추출물', '꿀', '나비콩꽃추출물', '나이아신', '나이아신아마이드', '납작파래추출물', '노르다이하이드로구아이아레틱애씨드', '녹차', '녹차추출물', '니코티닉애씨드', '니코틴아마이드', '님', '다발방패버섯추출물', '다이드제인', '다이팔미토일하이드록시프롤린', '다이펩타이드-2', '달맞이꽃오일', '달맞이꽃오일', '당근씨오일', '당호박', '당호박씨추출물', '당호박씨추출물', '돌콩스테롤', '돌콩오일', '돌콩추출물', '돌콩추출물', '동백나무꽃추출물', '두날리엘라 살리나추출물', '드럼스틱씨오일', '디에칠아미노하이드록시벤조일헥실벤조에이트', '딜추출물', '땅꽈리추출물', '라미나리아 오크롤레우카추출물', '라이신', '라이신에이치씨엘', '라이코펜', '라즈베리', '라즈베리추출물', '라즈베리추출물', '락틱애씨드', '레드호그위드뿌리추출물', '레스베라트롤', '레티놀', '레티닐레티노에이트', '레티닐아스코베이트', '레티닐팔미테이트', '레틴알', '로우스위트블루베리추출물', '로즈힙', '로즈힙', '로즈힙씨오일', '로즈힙씨추출물', '로즈힙열매오일', '로즈힙오일', '로터스씨추출물', '루테인', '루틴', '루핀', '루핀오일', '리놀레익애씨드', '린덴꽃추출물', '마그네슘아스코빌포스페이트', '마누카가지/잎오일', '마누카꿀', '마누카오일', '마데카소사이드', '마룰라', '마룰라씨오일', '마시멜로뿌리추출물', '마테', '마테잎추출물', '마테추출물', '마트리카리아꽃추출물', '마트리카리아꽃추출물', '마트리카리아오일', '망고스틴껍질추출물', '망고스틴껍질추출물', '메도우스위트', '메도우폼', '메도우폼씨오일', '메도우폼씨오일', '메라디메이트', '멕소릴SX', '멕시칸치아씨오일', '멕시칸치아씨오일', '멜론추출물', '무씨오일', '미리스토일트라이펩타이드-31', '미리스틸니코티네이트', '미역', '밀크씨슬추출물', '바바수씨오일', '바바수오일', '바베리(매자)', '바이오플라보노이드', '바쿠치올', '밤부사 불가리스잎/줄기추출물', '배더락스추출물', '백차잎추출물', '버독', '버독뿌리', '버독뿌리추출물', '베어베리잎추출물', '베어베리추출물', '병풀추출물', '보검선인장줄기추출물', '보리지씨오일', '보리지씨오일', '보리지씨추출물', '보리지씨추출물', '보리지추출물', '보이젠베리', '복령', '복령추출물', '부들레야추출물', '부티로스페르뭄 열매', '부틸메톡시디벤조일메탄', '분홍바늘꽃추출물', '불가리스매자뿌리추출물', '붉은토끼풀', '붉은토끼풀추출물', '브로콜리추출물', '블래더랙추출물', '블래더랙추출물', '블랙라즈베리', '블랙라즈베리', '블랙라즈베리열매추출물', '블랙베리(서양산딸기)', '블랙엘더베리', '블랙엘더베리', '블랙체리열매추출물', '블랙커런트오일', '비사보롤', '비오틴/폴릭애씨드/시아노코바라민/니아신아마이드/판토테닉애씨드/피리독신/리보플라빈/티아민/효모폴리펩테이드', '비타민 A', '비타민 B3', '비타민 B5', '비타민 C', '비타민 E', '비타민 F', '비타민나무', '비타민나무열매추출물', '비타민나무열매추출물', '비파나무', '비파나무잎추출물', '빌베리', '빌베리씨오일', '빌베리열매추출물', '빌베리잎추출물', '빌베리추출물', '뽕나무뿌리추출물', '뽕나무추출물', '사과추출물', '사과추출물', '사향장미씨오일', '삭제', '삭제', '삭제', '살구', '살구', '살구씨오일', '살구씨오일', '살리실릭애씨드', '삼씨오일', '삼씨오일', '서양산딸기추출물', '서양자두씨오일', '서인도체리열매추출물', '석류나무추출물', '석류추출물', '석류추출물', '세라마이드', '세라마이드에이피', '세라마이드엔에스', '세라마이드엔지', '세라마이드엔피', '세라마이드이오에스', '세라마이드이오피', '셀레늄', '소듐아스코베이트', '소듐아스코빌포스페이트', '소듐하이알루로네이트', '소듐하이알루로네이트크로스폴리머', '소이아이소플라본', '소이아이소플라본', '쇠비름', '쇠비름추출물', '수레국화', '수리딸기', '수리딸기추출물', '수박씨오일', '수박추출물', '수박추출물', '수퍼옥사이드디스뮤타아제', '슈가켈프', '슈가켈프추출물', '스위트브라이어', '스위트브라이어열매추출물', '스위트아몬드오일', '스위트아몬드오일', '스위트체스트넛로즈열매추출물', '스쿠알란', '스쿠알렌', '스테아릴글리시레티네이트', '스페인감초', '스페인감초뿌리추출물', '스핑고리피드', '시금치추출물', '시어버터추출물', '실버팁백차잎추출물', '씨벅톤 (비타민나무)', '아데노신트라이포스페이트', '아데노신트라이포스페이트', '아르간', '아르간오일', '아르간커넬오일', '아리스타타매자', '아리스토텔리아 킬렌시스 마키', '아마', '아마씨오일', '아마씨오일', '아마씨오일', '아보벤존', '아보카도오일', '아보카도오일', '아보카도오일', '아사이', '아사이팜열매추출물', '아세로라추출물', '아세틸다이펩타이드-1세틸에스터', '아세틸에스에이치-헥사펩타이드-5아마이드아세테이트', '아세틸테트라펩타이드-11', '아세틸테트라펩타이드-5', '아세틸테트라펩타이드-9', '아세틸헥사펩타이드-1', '아세틸헥사펩타이드-37', '아세틸헥사펩타이드-8', '아스코빅애씨드', '아스코빌글루코사민', '아스코빌글루코사이드', '아스코빌메틸실란올펙티네이트', '아스코빌팔미테이트', '아스타잔틴', '아스타잔틴추출물', '아스퍼질러스발효물', '아시아틱애씨드', '아연', '아이리쉬모스', '아이리쉬모스추출물', '아이비고드열매추출물', '아젤라오일-비스-다이펩타이드-10', '아하', '안토시아닌', '알로에베라잎즙가루', '알지닌', '알지닌/라이신폴리펩타이드', '알파-글루칸올리고사카라이드', '알파-리포익에씨드', '알파-비사보롤', '알파-알부틴', '알파-토코페롤', '알파-하이드록시애씨드', '알팔파추출물', '암모늄글라이콜레이트', '야생딸기추출물', '약모밀추출물', '에르고티오네인', '에스에이치-폴리펩타이드-121', '에스피에프', '에칠헥실메톡시신나메이트', '에칠헥실살리실레이트', '에쿠올', '에키움 플란타기네움씨오일', '에피갈로카테킨갈레이트', '엘더베리', '엘더열매추출물', '엘더추출물', '엘라직애씨드', '엠블릭열매추출물', '여뀌', '여뀌추출물', '영지버섯추출물', '영하구기자추출물', '영하구기자추출물', '예르바마테추출물', '옐로우바스켓윌로우잎추출물', '오리자놀', '오미자추출물', '오미자추출물', '오일팜오일', '옥토크릴렌', '옥티노세이트', '옥티살레이트', '옥틸메톡시신나메이트', '옥틸살리실레이트', '올리브나무잎추출물', '올리브오일불검화물', '완두콩', '왜광대수염꽃추출물', '우바우르시추출물', '우엉', '우엉뿌리추출물', '울금뿌리', '월귤추출물', '월귤추출물', '윈터체리뿌리추출물', '윌로우허브', '유비퀴논', '유차나무', '유차나무잎추출물', '유채', '유채씨오일', '유채씨오일', '은행나무잎추출물', '인도멀구슬나무꽃추출물', '인도멀구슬나무잎추출물', '인디안구스베리열매추출물', '인삼', '인삼추출물', '잇꽃씨오일', '잎새버섯자실체추출물', '자두씨오일', '자외선차단지수', '자주개자리', '자주개자리추출물', '제니스테인', '제라늄추출물', '제룸본', '조류', '조류추출물', '지엘에이', '지치', '진들딸기추출물', '징크옥사이드', '찔레꽃열매추출물', '참깨', '참깨오일', '참깨오일', '참산호말추출물', '채널드랙추출물', '체리추출물', '칡', '칡뿌리', '칡뿌리추출물', '카노식애씨드', '카놀라오일', '카르노신', '카멜리아 시넨시스', '카카오버터', '카카오씨버터', '카카오추출물', '카페익애씨드', '카프로오일스핑고신', '카프로오일테트라펩타이드-3', '카프로오일피토스핑고신', '칸나비디올', '칼슘아스코베이트', '칼슘판토테네이트', '캐모마일', '캐모마일꽃추출물', '커큐민', '커피나무열매추출물', '커피콩오일', '커피콩추출물', '케일잎추출물', '코엔자임 큐텐', '코코넛야자열매추출물', '콜레스테롤', '콜린', '콩오일', '콩추출물', '쿠쿠이나무씨오일', '쿠쿠이넛오일', '쿼세틴', '크랜베리씨오일', '크랜베리씨오일', '크랜베리씨추출물', '크랜베리추출물', '크리산텔룸 인디쿰추출물', '크산토필', '크산토필', '큰노랑용담뿌리추출물', '키위추출물', '키위추출물', '타우린', '타타릭애씨드', '탄닉애씨드', '터리풀추출물', '테레프탈릴리덴디캠퍼설포닉애씨드', '테트라데실아미노부티로일발릴아미노부티릭우레아트라이플루오로아세테이트', '테트라비스디메톡시하이드로커큐민', '테트라하이드로다이페룰로일메탄', '테트라하이드로디메톡시다이페룰로일메탄', '테트라하이드로디메톡시커큐민', '테트라하이드로메톡시커큐민', '테트라헥실데실아스코베이트', '토코트라이엔올', '토코페롤', '토코페롤아세테이트', '토코페릴리놀리에이트', '토코페릴아세테이트', '트라넥사믹애씨드', '트라이펩타이드-1', '트라이펩타이드-29', '트록세루틴', '트루로즈오브예리코추출물', '티옥틱애씨드', '티타늄디옥사이드', '파르솔1789', '파이코사이아닌', '팔미토일다이펩타이드-10', '팔미토일다이펩타이드-5다이아미노부틸로일하이드록시트레오닌', '팔미토일올리고펩타이드', '팔미토일테트라펩타이드-7', '팔미토일트라이펩타이드-1', '팔미토일트라이펩타이드-38', '팔미토일트라이펩타이드-5', '팔미토일트라이펩타이드-8', '팔미토일펜타펩타이드-4', '팔미토일헥사펩타이드-12', '팜오일', '패션프룻씨오일', '페룰릭애씨드', '펜타펩타이드', '펜타펩타이드-59', '펩타이드', '포도씨오일', '포도씨오일', '포도씨추출물', '포도씨추출물', '포타슘아스코빌토코페릴포스페이트', '폴리글루타믹애씨드', '폴리사카라이드', '폴리하이드록시산', '퐁감씨오일', '표고버섯추출물', '푸링(복령)', '풍선덩굴', '풍선덩굴추출물', '프랑스해안송껍질추출물', '프롤린', '플라보노이드', '플로레틴', '플리니아카울리플로라열매추출물', '플리니아카울리플로라열매추출물', '피나무', '피나무추출물', '피부 보충 성분', '피부 진정제', '피부 회복 성분', '피에이치에이', '피토세라마이드', '피토스핑고신', '피토스핑고신포스페이트', '하이드로제네이티드올리브오일', '하이드로코틸추출물', '하이드록시데실유비퀴논', '하이드록시스테로이드옥시도리덕타아제', '하이드록시스테로이드옥시도리덕타아제', '하이드롤라이즈드글라이코사미노글리칸', '하이드롤라이즈드로켓잎', '하이드롤라이즈드보검선인장꽃추출물', '하이드롤라이즈드콩단백질', '하이드롤라이즈드펌프킨씨드케이크', '하이알루로닉애씨드', '항산화제', '해마토코쿠스 플루비알리스추출물', '해바라기씨오일', '해바라기씨오일', '해바라기씨오일', '해바라기오일', '헤스페리딘', '헤스페리딘메틸칼콘', '헥사노일다이펩타이드-3노류신아세테이트', '헥실레조시놀', '호모살레이트', '호박', '호박씨추출물', '호스테일켈프', '호스테일켈프추출물', '호장근뿌리추출물', '호호바', '호호바', '호호바씨오일', '호호바오일', '홍차', '화이트루핀씨오일', '화이트루핀추출물', '황기', '효모추출물', '흰목이버섯포자낭과추출물', '흰무늬엉겅퀴씨오일', '흰무늬엉겅퀴열매추출물', '흰무늬엉겅퀴추출물', '히더꽃추출물', '히스티딘']
g1_1=['Argireline', 'L-시스테인', 'Seamollient', '가는골무꽃추출물', '가시칠엽수', '가지열매추출물', '갈락토아라비난', '갈락토아라비난', '개꽃추출물', '개청각추출물', '검은뽕나무뿌리추출물', '겔리디엘라 아세로사추출물', '구주소나무추출물', '꿀풀', '다이라우릴티오다이프로피오네이트', '다이소듐루티닐다이설페이트', '다이에틸헥실시링질리덴말로네이트', '당느릅나무뿌리추출물', '대추추출물', '덜스', '도둑놈의지팡이뿌리추출물', '독로제(로즈힙)', '두르빌레아 안타르티카추출물', '라즈베리씨오일', '라즈베리씨추출물', '락토코쿠스발효용해물', '렌틸콩추출물', '렌틸콩추출물', '로즈마리잎추출물', '로즈마리추출물', '루이보스추출물', '마그네슘아스코빌팔미테이트', '마리골드', '마운틴페퍼열매/잎추출물', '마이크로시스티스 애루지노사', '마이크로크리스탈린셀룰로오스', '만주자작나무', '만주자작나무껍질추출물', '말라카이트추출물', '망고뿌리', '메티오닌', '멕시칸자이언트히솝꽃/잎/줄기추출물', '멕시칸자이언트히솝꽃/잎/줄기추출물', '물냉이추출물', '물냉이추출물', '밀배아글리세라이즈', '밀배아오일', '밀배아추출물', '밀아미노산', '바닐라열매추출물', '발레이추출물', '베타-카로틴', '부메트라이졸', '붉은토끼풀', '브라질넛추출물', '브라질넛추출물', '브로드스펙트럼', '블랙 멀버리(검은뽕나무)', '블랙코호시(승마)', '비타민 B12', '비타민 D', '비타민 K', '비트뿌리추출물', '사르가숨 필리펜둘라추출물', '사이아노코발아민', '사탕무뿌리추출물', '산뽕나무뿌리추출물', '생강추출물', '서양자두씨추출물', '세린', '셀러리추출물', '솔방울추출물', '스위트아몬드', '스위트아몬드열매추출물', '스피룰리나', '스피룰리나 막시마추출물', '시엽감송', '시엽감송추출물', '실크단백질', '아미그달릭애씨드', '아세틸메티오닌', '아세틸알지닐트립토필다이페닐글라이신', '아세틸옥타펩타이드-3', '아스파라곱시스 아르마타추출물', '아스파라진', '아시아티코사이드', '안디로바씨오일', '안펠티아 콘신나추출물', '알라닌', '알진', '얼룩파인애플추출물', '에르고칼시페롤', '에틸페룰레이트', '에틸헥실메톡시크릴렌', '오이열매추출물', '오이추출물', '옥시벤존', '올리브오일', '올리브오일', '올리브오일', '위트점오일', '유럽밤나무씨추출물', '자두추출물', '자운영', '자이언트켈프추출물', '자주천인국추출물', '채퍼랠추출물', '치커리', '카세인', '카퍼트라이펩타이드-1', '칼슘판테테인설포네이트', '캐나다딱총', '캐나다딱총추출물', '켈프추출물', '코직다이팔미테이트', '코직애씨드', '콜레칼시페롤', '쿠마린', '크레오소트부시', '크레오소트부시추출물', '클로로필린-카퍼컴플렉스', '타마누오일', '트라이펩타이드-32', '트레오닌', '티오타우린', '파디나 파보니카추출물', '파인애플추출물', '팔손이분홍치추출물', '패션프룻열매추출물', '패션프룻추출물', '팩스', '페닐알라닌', '펜타펩타이드-18', '포트마리골드꽃추출물', '폴릭애씨드', '폴스산달우드씨오일', '프로폴리스', '피타야추출물', '하이드록시아세토페논', '하이드롤라이즈드아카시아 마크로스타키아씨추출물', '해조', '호동씨오일', '호프', '호프추출물', '홀스체스트넛추출물', '황금전초추출물', '황금전초추출물', '황기', '황기뿌리', '효모', '히솝']
g2_0=['바하', '베타-하이드록시애씨드', '살리실릭애씨드', '카프릴로일살리실릭애씨드']
g2_1=['벤토나이트']
g3_0=['3-O-에틸아스코빅애씨드', 'L-아스코빅애씨드', '감초뿌리', '감초추출물', '글라브리딘', '글리세릴아스코베이트', '글리시레티닉애씨드', '글리시레틱애씨드', '다이포타슘글리시리제이트', '다이포타슘글리시리지네이트', '돌콩추출물', '라이소포스파티딜에탄올아민', '라이소포스파티딜에탄올아민', '레스베라트롤', '미리스틸니코티네이트', '밀크씨슬추출물', '베어베리잎추출물', '비타민 C', '뽕나무추출물', '삭제', '소듐아스코베이트', '소듐아스코빌포스페이트', '스페인감초', '스페인감초뿌리추출물', '아스코빅애씨드', '아스코빌글루코사이드', '아스코빌팔미테이트', '아젤라익애씨드', '아젤렉스', '아하', '알부틴', '알파-알부틴', '에르고티오네인', '테트라펩타이드-30', '테트라헥실데실아스코베이트', '트라넥사믹애씨드', '포타슘아젤로일다이글라이시네이트', '헥실레조시놀', '흰무늬엉겅퀴씨오일', '흰무늬엉겅퀴열매추출물', '흰무늬엉겅퀴추출물']
g3_1=['다이라우릴티오다이프로피오네이트', '도둑놈의지팡이뿌리추출물', '블랙 멀버리(검은뽕나무)', '아미그달릭애씨드', '코직애씨드']
g4_0=['3-O-에틸아스코빅애씨드', 'D-알파-토코페롤', 'L-아스코빅애씨드', '강황(울금)', '글라브리딘', '글라이콜릭애씨드', '글루코노락톤', '글리세릴아스코베이트', '돌콩추출물', '락토바이오닉애씨드', '락틱애씨드', '레틴알', '말릭애씨드', '밀크씨슬추출물', '바쿠치올', '비타민 B3', '비타민 C', '비타민 E', '빌베리추출물', '뽕나무추출물', '소듐아스코베이트', '소듐아스코빌포스페이트', '소이아이소플라본', '스테아릴글리시레티네이트', '아세틸글루코사민', '아스코빅애씨드', '아스코빌글루코사이드', '아스코빌팔미테이트', '아스퍼질러스발효물', '아젤라오일-비스-다이펩타이드-10', '아하', '알부틴', '알파-알부틴', '알파-하이드록시애씨드', '암모늄글라이콜레이트', '우레아', '우바우르시추출물', '제룸본', '칡', '칡뿌리', '칡뿌리추출물', '콩추출물', '타타릭애씨드', '테트라헥실데실아스코베이트', '토코트라이엔올', '토코페롤', '트라넥사믹애씨드', '포타슘아젤로일다이글라이시네이트', '폴리하이드록시산', '플로레틴', '피에이치에이', '헥사노일다이펩타이드-3노류신아세테이트']
g4_1=['다이소듐루티닐다이설페이트', '만델릭애씨드', '블랙 멀버리(검은뽕나무)', '비타민 K', '아미그달릭애씨드', '얼룩파인애플추출물', '코직애씨드', '파이틱애씨드', '펜타펩타이드-18', '황금전초추출물']
g5_0=['(아몬드/보리지/아마/올리브)애씨드/글리세라이즈', 'C10-30콜레스테롤/라노스테롤에스터', 'D-판테놀', 'N-하이드록시석신이미드', '감마리놀레닉애씨드', '글라이신', '글라이코리피드', '글라이코사미노글리칸', '글라이코스핑고리피드', '글루코노락톤', '글루코만난', '글루코사민에이치씨엘', '글루코실세라마이드', '글루타민', '글리세린', '글리세린', '글리세릴베헤네이트', '꿀', '꿀추출물', '나이아신', '난황추출물', '다이메티콘', '다이팔미토일하이드록시프롤린', '다이헵틸석시네이트', '달맞이꽃오일', '달맞이꽃오일', '당근씨오일', '당호박씨추출물', '데카르복시카르노신에이치씨엘', '돌콩스테롤', '돌콩오일', '돌콩추출물', '드럼스틱씨오일', '땅콩추출물', '라우릭애씨드', '라우릴라우레이트', '라이소포스파티딜에탄올아민', '라이소포스파티딜에탄올아민', '라이신', '라이신에이치씨엘', '락토바실러스', '락토바실러스/코코넛야자열매즙발효여과물', '락토바실러스/호밀가루발효물', '락토바실러스발효물', '락토바이오닉애씨드', '락토퍼옥시다아제', '락틱애씨드', '레시틴', '로즈힙씨오일', '로즈힙열매오일', '로즈힙오일', '루틴', '루핀오일', '류신', '리놀레닉애씨드', '리놀레익애씨드', '린덴꽃추출물', '마그네슘아스코빌포스페이트', '마그네슘피씨에이', '마누카가지/잎오일', '마누카오일', '마룰라', '마룰라씨오일', '망고씨버터', '메도우폼씨오일', '메도우폼씨오일', '메도우폼씨오일', '멕시칸치아씨오일', '멕시칸치아씨오일', '무씨오일', '무화과', '무화과추출물', '뮤코다당류', '미리스토일펜타펩타이드-17', '미리스토일헥사펩타이드-16', '미리스틸니코티네이트', '바바수', '바바수씨오일', '바바수씨오일', '바바수오일', '배더락스추출물', '베타-글루칸', '베타-시토스테롤', '보리지씨오일', '보리지씨오일', '보습제(습윤제)', '부티로스페르뭄 열매', '블래더랙추출물', '블랙커런트오일', '비오틴/폴릭애씨드/시아노코바라민/니아신아마이드/판토테닉애씨드/피리독신/리보플라빈/티아민/효모폴리펩테이드', '비타민 B5', '비타민 F', '비파나무잎추출물', '비피다발효용해물', '빌베리씨오일', '사과추출물', '사과추출물', '사카라이드', '사카라이드아이소머레이트', '사코신', '사향장미씨오일', '삭제', '살구씨오일', '살구씨오일', '삼씨오일', '삼씨오일', '서양자두씨오일', '세라마이드', '세라마이드에이피', '세라마이드엔에스', '세라마이드엔지', '세라마이드엔피', '세라마이드이오에스', '세라마이드이오피', '세팔린', '센나씨폴리사카라이드', '소듐라우로일귀리아미노산', '소듐콘드로이틴설페이트', '소듐피씨에이', '소듐피씨에이', '소듐하이알루로네이트', '소듐하이알루로네이트크로스폴리머', '솔비톨', '쇠비름추출물', '수박씨오일', '수박추출물', '수박추출물', '수퍼옥사이드디스뮤타아제', '스위트아몬드오일', '스위트아몬드오일', '스쿠알란', '스쿠알렌', '스핑고리피드', '시어나무', '시어버터추출물', '쌀겨추출물', '쌀왁스', '아르간오일', '아르간커넬오일', '아마씨오일', '아마씨오일', '아마씨오일', '아몬드오일', '아미노애씨드', '아보카도오일', '아보카도오일', '아보카도오일', '아사이팜스테롤', '아사이팜스테롤', '아세틸글루코사민', '아세틸카르니틴에이치씨엘', '아세틸테트라펩타이드-11', '아세틸헥사펩타이드-1', '아세틸헥사펩타이드-37', '아세틸헥사펩타이드-8', '아스코빌메틸실란올펙티네이트', '아스퍼질러스발효물', '아이리쉬모스', '아이리쉬모스추출물', '아이비고드열매추출물', '안펠티옵시스 콩킨나추출물', '알로에', '알로에베라', '알로에베라잎즙', '알로에베라잎즙추출물', '알로에베라잎추출물', '알로에즙', '알로에추출물', '알지닌', '알지닌/라이신폴리펩타이드', '알파-글루칸올리고사카라이드', '알파-하이드록시애씨드', '에이코사펜타에노익애씨드', '에키움 플란타기네움씨오일', '에틸헥실올리베이트', '엑토인', '여뀌', '여뀌추출물', '영하구기자추출물', '오미자추출물', '오미자추출물', '오일팜오일', '오트베타글루칸', '옥수수오일', '올리브오일불검화물', '우레아', '유채씨오일', '유채씨오일', '이노시톨', '이눌린', '잇꽃씨오일', '잇꽃오일', '자두씨오일', '자일리톨', '조류', '조류추출물', '지방산', '지엘에이', '지질', '징크피씨에이', '참깨오일', '참깨오일', '참산호말추출물', '채널드랙추출물', '채널드랙추출물', '천연보습인자', '카놀라오일', '카카오버터', '카카오씨버터', '카탈라아제', '카프로오일스핑고신', '카프로오일피토스핑고신', '카프릴릭/카프릭트라이글리세라이드', '칸데릴라/호호바/쌀겨폴리글리세릴-3에스터', '칼슘피씨에이', '캐스터오일', '커피콩오일', '코코넛야자', '코코넛야자열매추출물', '코코넛야자오일', '코코넛오일', '콜레스테롤', '콜린', '콩오일', '쿠쿠이나무씨오일', '쿠쿠이넛오일', '크랜베리씨오일', '크랜베리씨오일', '크레아틴', '클로렐라 불가리스추출물', '테아닌', '토코페릴리놀리에이트', '트라이메틸실록시아모다이메티콘', '트라이올레인', '판테놀', '판테틴', '판토테닉애씨드', '팔미토일프롤린', '팜오일', '패션프룻씨오일', '펩타이드', '포도씨오일', '포도씨오일', '포스파티딜콜린', '포스포리피드', '포스포리피드', '포타슘피씨에이', '폴리글루타믹애씨드', '폴리글리세릴-3라이스브라네이트', '폴리사카라이드', '퐁감씨오일', '프롤린', '피마자씨오일', '피부 보충 성분', '피부 컨디셔닝 성분', '피토세라마이드', '피토스테롤', '피토스테릴/옥틸도데실라우로일글루타메이트', '피토스핑고신', '피토스핑고신포스페이트', '하이드로제네이티드돌콩오일', '하이드로제네이티드레시틴', '하이드로제네이티드올리브오일', '하이드로제네이티드채종유', '하이드록시스테로이드옥시도리덕타아제', '하이드록시스테로이드옥시도리덕타아제', '하이드록실레이티드레시틴', '하이드롤라이즈드글라이코사미노글리칸', '하이드롤라이즈드로도피세아추출물', '하이드롤라이즈드소듐하이알루로네이트', '하이드롤라이즈드펌프킨씨드케이크', '하이드롤라이즈드하이알루로닉애씨드', '하이드롤라이즈드호호바에스터', '하이알루로닉애씨드', '해바라기씨오일', '해바라기씨오일', '해바라기씨추출물', '해바라기오일', '호박', '호박씨추출물', '호호바', '호호바', '호호바버터', '호호바버터', '호호바씨오일', '호호바에스터', '호호바오일', '호호바왁스', '화이트루핀씨오일', '효모용해물', '효모추출물', '흰목이버섯포자낭과추출물']
g5_1=['1,2-헥산다이올', '10-하이드록시데카노익애씨드', 'C12-15알킬벤조에이트', 'C15-19알케인', 'C18-36애씨드트라이글리세라이드', 'Disiloxane', 'Sonojell', '갈락토아라비난', '갈락토아라비난', '감자추출물', '개꽃추출물', '구아하이드록시프로필트라이모늄클로라이드', '글라이코젠', '글라이콜스테아레이트', '글루코오스', '글루코오스옥시다아제', '글루타믹애씨드', '글루텐 성분', '글리세레스-18', '글리세레스-26', '글리세레스-7트라이아세테이트', '글리세롤트라이올리에이트', '글리세릴다이베헤네이트', '글리세릴다이스테아레이트', '글리세릴다이팔미테이트', '글리세릴라우레이트', '글리세릴로지네이트', '글리세릴미리스테이트', '글리세릴베헤네이트', '글리세릴스테아레이트', '글리세릴스테아레이트시트레이트', '글리세릴스테아레이트에스이', '글리세릴아이소스테아레이트', '글리세릴아이소팔미테이트', '글리세릴올리에이트', '글리세릴카프릴레이트', '글리세릴코코에이트', '글리세릴팔미테이트', '꿀풀', '네오펜틸글라이콜다이카프릴레이트/다이카프레이트', '네오펜틸글라이콜다이헵타노에이트', '노티드랙', '다이머다이리놀레일다이머다이리놀리에이트', '다이메티콘/비스-아이소부틸피피지-20크로스폴리머', '다이메티콘/피이지-10/15크로스폴리머', '다이메티콘올', '다이부틸아디페이트', '다이소듐글리세릴포스페이트', '다이소듐다이글리세릴포스페이트', '다이소듐라우리미노다이프로피오네이트토코페릴포스페이트', '다이아이소스테아로일트라이메틸롤프로판실록시실리케이트', '다이아이소스테아로일폴리글리세릴-3다이머다이리놀리에이트', '다이아이소스테아릴다이머다이리놀리에이트', '다이아이소스테아릴말레이트', '다이아이소옥틸석시네이트', '다이아이소프로필다이머다이리놀리에이트', '다이아이소프로필아디페이트', '다이카프릴릴에터', '다이카프릴릴카보네이트', '다이펜타에리스리틸테트라베헤네이트/폴리하이드록시스테아레이트', '다이펜타에리스리틸트라이-폴리하이드록시스테아레이트', '다이펜타에리스리틸헥사카프릴레이트/헥사카프레이트', '다이펜타에리스리틸헥사하이드록시스테아레이트', '다이-피피지-3미리스틸에터아디페이트', '당느릅나무뿌리추출물', '데실렌글라이콜', '덱스트란', '도데칸', '두르빌레아 안타르티카추출물', '드로미세우스오일', '디메티콘코폴리올', '땅콩오일', '땅콩오일', '라놀린', '라놀린알코올', '라우다이모늄하이드록시프로필하이드롤라이즈드밀단백질', '라우다이모늄하이드록시프로필하이드롤라이즈드콩단백질', '라우로일라이신', '라우릴알코올', '라이신카복시메틸시스테이네이트', '락토바이오네이트', '렌틸콩추출물', '마그네슘', '마그네슘아스코빌팔미테이트', '마그네슘아스파테이트', '마그네슘팔미토일글루타메이트', '마이크로크리스탈린왁스', '마카다미아씨오일', '만니톨', '만주자작나무수액', '만주자작나무수액', '말토덱스트린', '말토스', '말토올리고실글루코사이드', '맥주효모추출물', '메티오닌', '메티콘', '메틸글루세스-20', '메틸글루세스-20벤조에이트', '메틸글루코사이드포스페이트', '메틸글루코오스세스퀴스테아레이트', '메틸실란올만누로네이트', '메틸실란올피이지-7글리세릴코코에이트', '메틸트라이메티콘', '메틸프로판다이올', '멜리바이오스', '무루무루씨버터', '무환자나무껍질추출물', '미네랄오일', '미리스타미도프로필피지-다이모늄클로라이드포스페이트', '미리스틸미리스테이트', '미리스틸알코올', '밀단백질', '밀단백질', '밀배아글리세라이즈', '밀배아오일', '밀배아추출물', '밀아미노산', '바틸알코올', '발린', '베타인', '베헤네스-5', '베헤닐베헤네이트', '베헤닐알코올', '베헨트라이모늄클로라이드', '보리추출물', '부틸렌글라이콜', '부틸옥틸살리실레이트', '비누풀추출물', '비스-다이글리세릴폴리아실아디페이트', '비스-다이글리세릴폴리아실아디페이트-2', '비스-피이지-18메틸에터다이메틸실레인', '비즈왁스', '사이클로메티콘', '사이클로테트라실록세인', '사이클로펜타실록세인', '사이클로헥사실록세인', '사탕수수발효추출물', '세라알바', '세리신', '세린', '세스퀴올리에이트', '세테아레스-6올리베이트', '세테아릴알코올', '세테아릴에틸헥사노에이트', '세테아릴옥타노에이트', '세테아릴올리베이트', '세틸다이메티콘', '세틸아세테이트', '세틸알코올', '세틸에스터', '세틸피이지/피피지-10/1다이메티콘', '세틸하이드록시에틸셀룰로오스', '소듐글루코네이트', '소듐다이라우미도글루타미드라이신', '소듐락테이트', '소듐레불리네이트', '소듐스테아로일글루타메이트', '소듐카복시메틸베타-글루칸', '소듐팔미토일사코시네이트', '소듐피이지-7올리브오일카복실레이트', '수크로오스', '수크로오스라우레이트', '수크로오스스테아레이트', '스위트아몬드', '스위트아몬드', '스테아레이트', '스테아릭애씨드', '스테아릴메티콘', '슬립제', '시스테인', '시스틴', '시엽감송', '시엽감송추출물', '실란트라이올', '실리콘', '쌀겨오일', '쌀겨오일', '쌀오일', '아가', '아나시스티스니둘란스추출물', '아라키딕애씨드', '아라키딜알코올', '아라키딜프로피오네이트', '아르테미아추출물', '아메리카헤이즐넛씨오일', '아모다이메티콘', '아미노부티릭애씨드', '아세틸글루타민', '아세틸글리세릴리시놀리에이트', '아세틸레이티드라놀린', '아세틸레이티드라놀린알코올', '아세틸레이티드캐스터오일', '아세틸레이티드팜커넬글리세라이즈', '아세틸레이티드하이드로제네이티드코튼씨드글리세라이드', '아세틸메티오닌', '아세틸옥타펩타이드-3', '아세틸타이로신', '아스파라진', '아스파틱애씨드', '아이소류신', '아이소스테아릴네오펜타노에이트', '아이소스테아릴팔미테이트', '아이소아밀라우레이트', '아이소아밀코코에이트', '아이소펜틸다이올', '아이소프로필라놀레이트', '아이소프로필미리스테이트', '아이소프로필아이소스테아레이트', '아이소프로필팔미테이트', '아크릴레이트코폴리머', '안디로바씨오일', '안하이드로자일리톨', '알라닌', '알진', '알테로모나스발효추출물', '암모늄아크릴로일다이메틸타우레이트/브이피코폴리머', '야자씨버터', '에리스루로오스', '에뮤오일', '에틸마카다미에이트', '에틸헥실글리세린', '에틸헥실스테아레이트', '에틸헥실팔미테이트', '에틸헥실팔미테이트', '에틸헥실하이드록시스테아레이트', '오이열매추출물', '오이추출물', '오이추출물', '옥틸도데실네오펜타노에이트', '옥틸도데실미리스테이트', '옥틸도데칸올', '옥틸스테아레이트', '올레일에루케이트', '올리브오일', '올리브오일', '올리브오일', '올리브오일피이지-7에스터', '우유단백질', '위트점오일', '유럽개암', '유청단백질', '자이메니닉애씨드', '자이언트켈프추출물', '자일로오스', '자일리틸글루코사이드', '정제수', '정제수', '정제수', '지방알코올', '지방족탄화수소', '징크글루코네이트', '카나우바왁스', '카라기난', '카렌둘라추출물', '카세인', '카울레르파 탁시폴리아추출물', '카퍼글루코네이트', '카퍼라이시네이트/프롤리네이트', '카퍼피씨에이', '카프릴로일글라이신', '카프릴릴메티콘', '카프릴릴카프릴레이트/카프레이트', '칸데릴라왁스', '칸데릴라왁스', '캐스터아이소스테아레이트석시네이트', '켈프추출물', '코직다이팔미테이트', '코코글리세라이즈', '코코넛알칸', '코코일프롤린', '코코-카프릴레이트', '코코-카프릴레이트/카프레이트', '콜라겐아미노산', '퀴노아씨오일', '퀴노아오일', '퀼라자껍질추출물', '큰노랑꽃자리풀씨추출물', '클로렐라', '타라검', '타마누오일', '타마린드씨검', '탈염수', '트라이데실살리실레이트', '트라이데실스테아레이트', '트라이데실트라이멜리테이트', '트라이라우린', '트라이메틸실록시실리케이트', '트라이베헤닌', '트라이베헤닌피이지-20에스터', '트라이아이소세틸시트레이트', '트라이에톡시실릴에틸폴리다이메틸실록시에틸헥실다이메티콘', '트라이에틸헥사노인', '트라이오클라놀린', '트라이옥틸도데실시트레이트', '트라이카프릴린', '트라이펩타이드-32', '트라이하이드록시스테아린', '트라이헵타노인', '트레오닌', '트레할로오스', '트리옥타노인', '트립토판', '티오타우린', '파디나 파보니카추출물', '파라피늄리퀴둠', '파이틱애씨드', '판토락톤', '팔손이분홍치추출물', '패션프룻추출물', '페닐알라닌', '페닐트라이메티콘', '펜타에리스리틸다이스테아레이트', '펜타에리스리틸테트라에틸헥사노에이트', '펜타펩타이드-18', '펜틸렌글라이콜', '포타슘티오시아네이트', '폴리글루쿠로닉애씨드', '폴리글리세린-6', '폴리글리세릴-10다이올리에이트', '폴리글리세릴-10스테아레이트', '폴리글리세릴-2테트라아이소스테아레이트', '폴리글리세릴-2트라이아이소스테아레이트', '폴리글리세릴-3다이아이소스테아레이트', '폴리글리세릴-4라우레이트', '폴리글리세릴-4아이소스테아레이트', '폴리글리세릴-6다이스테아레이트', '폴리글리세릴-6아이소스테아레이트', '폴리글리세릴-6폴리리시놀리에이트', '폴리에틸렌글라이콜', '폴리쿼터늄-51', '폴스산달우드씨오일', '프로판다이올', '프로필렌글라이콜', '프로필렌글라이콜다이벤조에이트', '프로필렌글라이콜다이카프릴레이트/다이카프레이트', '프로필렌글라이콜라우레이트', '프로필렌글라이콜스테아레이트', '프로필렌글라이콜아이소스테아레이트', '프로필헵틸카프릴레이트', '프룩토오스', '플랑크톤추출물', '피브로넥틴', '피스타치오씨오일', '피스타치오씨오일', '피씨에이', '피이지-10다이메티콘', '피이지-10다이메티콘/비닐다이메티콘크로스폴리머', '피이지-10레이프씨드스테롤', '피이지-12글리세릴다이미리스테이트', '피이지-12다이메티콘', '피이지-14', '피이지-20글리세릴트라이아이소스테아레이트', '피이지-20메틸글루코오스세스퀴스테아레이트', '피이지-32', '피이지-33', '피이지-40하이드로제네이티드캐스터오일', '피이지-60아몬드글리세라이즈', '피이지-60하이드로제네이티드캐스터오일', '피이지-75', '피이지-75시어버터글리세라이즈', '피이지-7글리세릴코코에이트', '피이지-8', '피이지-8다이메티콘', '피칸씨오일', '피칸오일', '피칸오일', '피탄트라이올', '피토스테릴마카다미에이트', '피피지-12/에스엠디아이코폴리머', '피피지-14부틸에터', '피피지-20메틸글루코오스에터', '피피지-2미리스틸에터프로피오네이트', '피피지-3벤질에터미리스테이트', '하슬레아 오스트레아리아추출물', '하이드로제네이티드다이데센', '하이드로제네이티드스타치하이드롤리세이트', '하이드로제네이티드식물성글리세라이즈시트레이트', '하이드로제네이티드식물성오일', '하이드로제네이티드제팬왁스', '하이드로제네이티드코코-글리세라이즈', '하이드로제네이티드팜글리세라이즈', '하이드로제네이티드포스파티딜콜린', '하이드로제네이티드폴리데센', '하이드로제네이티드폴리아이소부텐', '하이드로제네이티드호호바오일', '하이드록시아세토페논', '하이드롤라이즈드밀단백질', '하이드롤라이즈드식물성단백질', '하이드롤라이즈드실크', '하이드롤라이즈드옥수수전분', '하이드롤라이즈드완두콩단백질', '하이드롤라이즈드타라검', '하이드롤라이즈드호호바단백질', '해바라기씨왁스', '해조', '헤이즐넛오일', '헥실데칸올', '헥실라우레이트', '헵틸운데실레네이트', '호동씨오일', '호두오일', '효모', '효모/구리발효물', '효모/마그네슘발효물', '효모/망간발효물', '효모/셀레늄발효물', '효모/실리콘발효물', '효모/아연발효물', '효모/철발효물', '효모/칼슘발효물', '효모/포타슘발효물', '효소(엔자임)']
g6_0=['녹차', '레틴알', '메도우스위트', '에피갈로카테킨갈레이트', '징크옥사이드']
g6_1=['나일론-12', '덱스트린', '마그네슘', '마그네슘알루미늄실리케이트', '마그네슘카보네이트', '마그네슘하이드록사이드', '말토덱스트린', '메틸메타크릴레이트/글라이콜다이메타크릴레이트크로스폴리머', '몬모릴로나이트', '벤토나이트', '소듐폴리아크릴레이트', '소듐폴리아크릴레이트스타치', '숯', '숯가루', '실리카', '실리케이트', '실리콘', '실크가루', '쌀전분', '알루미늄마그네슘실리케이트', '알루미늄전분옥테닐석시네이트', '알루미늄하이드록사이드', '옥수수전분', '옥수수전분', '일라이트', '카올린', '칼슘카보네이트', '타피오카전분', '풀러토', '하이드롤라이즈드옥수수전분', '헥토라이트']
g7_0=['나이아신아마이드', '니코티닉애씨드', '니코틴아마이드', '레티놀', '레티닐레티노에이트', '레티닐아스코베이트', '비타민 A', '비타민 B3']
g7_1=['실리콘', '카올린', '헥토라이트']
g8_0=['가시선인장', '글라이콜릭애씨드', '락토바이오닉애씨드', '말릭애씨드', '벤조일퍼옥사이드', '아젤라익애씨드', '아젤렉스', '우레아', '타타릭애씨드', '폴리하이드록시산', '피에이치에이', '하이드롤라이즈드보검선인장꽃추출물']
g8_1=['만델릭애씨드', '브로멜라인']
g9_0=['D-판테놀', '가시선인장', '가자열매추출물', '감초뿌리', '감초뿌리추출물', '감초추출물', '강황(울금)', '고투콜라', '국화추출물', '귀리겨추출물', '귀리커넬오일', '귀리커넬추출물', '귀리커넬추출물', '귀리커넬추출물', '그롬웰', '글라브리딘', '글리시레티닉애씨드', '글리시레틱애씨드', '꿀', '꿀추출물', '나비콩꽃추출물', '나이아신아마이드', '녹차', '녹차추출물', '니코티닉애씨드', '니코틴아마이드', '다발방패버섯추출물', '다이포타슘글리시리제이트', '다이포타슘글리시리지네이트', '달맞이꽃오일', '당아욱', '독일가문비목부추출물', '돌콩추출물', '두날리엘라 살리나추출물', '딜추출물', '땅꽈리추출물', '땅콩추출물', '라미나리아 오크롤레우카추출물', '라우릭애씨드', '라즈베리추출물', '라즈베리추출물', '락토바실러스발효물', '레드호그위드뿌리추출물', '레스베라트롤', '로즈힙오일', '로터스씨추출물', '루브라터리풀', '마누카꿀', '마데카소사이드', '마시멜로', '마시멜로', '마시멜로뿌리추출물', '마테', '마테잎추출물', '마테추출물', '마트리카리아꽃추출물', '마트리카리아오일', '메도우스위트', '멕시칸치아씨오일', '멕시칸치아씨오일', '미리스토일펜타펩타이드-17', '미리스토일헥사펩타이드-16', '미역', '바베리(매자)', '바실러스발효물', '바쿠치올', '바하', '배더락스추출물', '백차잎추출물', '버독', '버독뿌리', '버독뿌리추출물', '베어베리추출물', '베타-글루칸', '베타-하이드록시애씨드', '병풀추출물', '보리지씨오일', '보리지씨오일', '보리지씨추출물', '보리지씨추출물', '보리지추출물', '복령', '복령추출물', '분홍바늘꽃추출물', '분홍바늘꽃추출물', '불가리스매자뿌리추출물', '붉은토끼풀', '붉은토끼풀추출물', '블래더랙추출물', '블래더랙추출물', '블랙엘더베리', '블랙엘더베리', '블랙윌로우나무껍질추출물', '블랙체리열매추출물', '비사보롤', '비타민 B5', '비타민 E', '비타민나무', '비타민나무열매추출물', '비타민나무열매추출물', '비피다발효용해물', '빌베리', '빌베리씨오일', '빌베리열매추출물', '빌베리잎추출물', '뽕나무뿌리추출물', '삭제', '삭제', '석류나무추출물', '석류추출물', '석류추출물', '소듐라우로일귀리아미노산', '소듐피씨에이', '소듐피씨에이', '소듐하이알루로네이트', '소듐하이알루로네이트크로스폴리머', '소이아이소플라본', '쇠비름', '쇠비름추출물', '수레국화', '수레국화', '수리딸기', '수리딸기추출물', '슈가켈프', '슈가켈프추출물', '슈도프테로고지아 엘리사베태(채찍산호)', '스위트아몬드오일', '스테아릴글리시레티네이트', '스페인감초', '스페인감초뿌리추출물', '스핑고리피드', '시금치추출물', '시어버터불검화물', '실버팁백차잎추출물', '씨벅톤 (비타민나무)', '아데노신', '아데노신트라이포스페이트', '아데노신트라이포스페이트', '아데노신포스페이트', '아마씨오일', '아마씨오일', '아보카도오일', '아보카도오일', '아사이', '아사이팜열매추출물', '아세틸글루코사민', '아세틸테트라펩타이드-5', '아스타잔틴', '아스타잔틴추출물', '아연', '아젤라오일-비스-다이펩타이드-10', '안토시아닌', '안펠티옵시스 콩킨나추출물', '알란토인', '알로에', '알로에베라', '알로에베라잎즙', '알로에베라잎즙추출물', '알로에베라잎추출물', '알로에즙', '알로에추출물', '알파-글루칸올리고사카라이드', '알파-비사보롤', '약모밀추출물', '에델바이스추출물', '에보디아열매추출물', '에스에이치-폴리펩타이드-121', '에키네시아', '에필로비움 플레이스케리추출물', '에필로비움 플레이스케리추출물', '엘더열매추출물', '엘더추출물', '여뀌', '여뀌추출물', '예르바마테추출물', '오미자추출물', '오미자추출물', '오트밀', '오트베타글루칸', '올레아놀릭애씨드', '올리브오일불검화물', '완두콩', '왜광대수염꽃추출물', '우바우르시추출물', '우엉', '우엉뿌리추출물', '울금뿌리', '월귤추출물', '월귤추출물', '윌로우허브', '유비퀴논', '유차나무', '유차나무잎추출물', '은행나무잎추출물', '이눌린', '인동덩굴', '인동덩굴꽃추출물', '인디안구스베리열매추출물', '잎새버섯자실체추출물', '자일리톨', '자주개자리', '자주개자리추출물', '제니스테인', '제룸본', '조류', '조류추출물', '주화', '지치', '진들딸기추출물', '징크옥사이드', '채찍산호추출물', '카멜리아 시넨시스', '카카오씨버터', '카프릴로일살리실릭애씨드', '칸나비디올', '캐모마일', '캐모마일꽃추출물', '커큐민', '케일잎추출물', '코엔자임 큐텐', '콜로이달오트밀', '콩추출물', '쿼세틴', '크랜베리추출물', '크리산텔룸 인디쿰추출물', '크산토필', '크산토필', '큰꽃삽주뿌리가루', '클로렐라 불가리스추출물', '키위추출물', '키토산', '테아닌', '테트라비스디메톡시하이드로커큐민', '테트라펩타이드-30', '테트라하이드로다이페룰로일메탄', '테트라하이드로디메톡시다이페룰로일메탄', '테트라하이드로디메톡시커큐민', '테트라하이드로메톡시커큐민', '토코트라이엔올', '토코페롤', '토코페롤아세테이트', '토코페릴리놀리에이트', '토코페릴아세테이트', '트루로즈오브예리코추출물', '파이어위드추출물', '파이코사이아닌', '판테놀', '판토테닉애씨드', '펜타펩타이드-59', '펩타이드', '포타슘아젤로일다이글라이시네이트', '표고버섯추출물', '풍선덩굴', '풍선덩굴추출물', '프랑스해안송껍질추출물', '피부 진정제', '피토스테롤', '하이드로코틸추출물', '하이드롤라이즈드로도피세아추출물', '하이드롤라이즈드보검선인장꽃추출물', '항산화제', '해마토코쿠스 플루비알리스추출물', '허니서클꽃추출물', '허니서클꽃추출물', '헥실레조시놀', '호스테일켈프', '호스테일켈프추출물', '호장근뿌리추출물', '호호바', '호호바씨오일', '홍차', '화이트루핀씨오일', '효모추출물', '흰목이버섯포자낭과추출물', '흰무늬엉겅퀴씨오일', '흰무늬엉겅퀴열매추출물', '흰무늬엉겅퀴추출물', '흰버드나무추출물', '히더꽃추출물', '히스티딘']
g9_1=['Sonojell', '가는골무꽃추출물', '가시칠엽수', '갈락토아라비난', '갈락토아라비난', '개꽃추출물', '노니', '노니즙', '당느릅나무뿌리추출물', '당아욱추출물', '대추추출물', '독우드', '로즈마리잎추출물', '로즈마리추출물', '루이보스추출물', '마그네슘카복시메틸베타-글루칸', '마리골드', '만주자작나무껍질추출물', '무환자추출물', '바닐라열매추출물', '발린', '살리신', '생강추출물', '석시닉애씨드', '스피룰리나', '스피룰리나 막시마추출물', '아라비아고무나무검', '아세틸알지닐트립토필다이페닐글라이신', '아스파라곱시스 아르마타추출물', '아스파틱애씨드', '아시아티코사이드', '안펠티아추출물', '안펠티아 콘신나추출물', '알진', '에틸페룰레이트', '오이추출물', '올리고펩타이드-10', '윌로우나무껍질', '자이언트켈프추출물', '자일로오스', '자일리틸글루코사이드', '자주천인국추출물', '접시꽃', '층층나무추출물', '카렌둘라추출물', '캣츠클로추출물', '켈프추출물', '클로렐라', '파인애플추출물', '팔손이분홍치추출물', '포타슘아스파테이트', '포트마리골드꽃추출물', '프로폴리스', '피버퓨꽃추출물', '하이드록시페닐프로파미도벤조익애씨드', '해조', '홀스체스트넛추출물', '황금전초추출물', '황금전초추출물', '효모', '흰버드나무', '흰버드나무껍질가루', '흰버드나무껍질추출물']
oily_good = ["글라이콜릭애씨드","살리실릭애씨드","노녹시놀-9","녹차","위치하젤","레몬","캄파","멘톨",
                "클로로필","알란토인","티트리","감초","징크옥사이드","포트마리골드꽃추출물","황","트리클로산",
                "티타늄디옥사이드"]
dry_good = ["하이알루로닉애씨드","글리세린","프로필렌글라이콜",'1,3-부틸렌글라이콜',"소듐피씨에이","비타민E",
               "비타민A","비타민C","엘라스틴","아보카도오일","달맞이꽃오일","오트밀","카모마일","오이","복숭아",
               "해조추출물","뽕나무껍질추출물","코직|애씨드","알부틴","포도씨추출물","베타-카로틴","시어버터",
               "피카리아미나리아재비추출물","비타민B복합체","판테놀"]

# 가중치 부여할 주의 성분들 리스트 (p_number_0 : 보통 , p_number_1 : 나쁨, p_number_2 : 매우나쁨)
p0_0 = ['티트리오일']
p0_1 = ['설퍼콜로이드']
p0_2 = []
p1_0 = ['N-아세틸-L-타이로신', '감추출물', '고수', '다이펩타이드다이아미노부티로일벤질아마이드다이아세테이트', '리보오스', '만주자작나무껍질추출물', '만주자작나무잎추출물', '망가니즈글루코네이트', '모노기나산사추출물', '모창출뿌리추출물', '바이오틴', '바질꽃추출물', '바질잎추출물', '비타민 B1', '비타민 B6', '비타민 H', '삼색제비꽃추출물', '서양고추나물꽃/잎/줄기추출물', '슬리퍼리엘름나무껍질', '슬리퍼리엘름나무껍질추출물', '쓴쑥추출물', '아나토씨추출물', '참갈파래추출물', '카페인', '클레리세이지', '키네틴', '티아민에이치씨엘', '티오다이프로피오닉애씨드', '파디메이트 O', '파파야잎추출물', '페닐에틸레조시놀', '포르피리듐 크루엔툼추출물', '프로방스장미', '프로방스장미꽃', '프로방스장미씨추출물', '호두나무열매껍질추출물', '호두추출물', '화이트네틀', '히비스커스', '히페리쿰추출물']
p1_1 = ['UVA', 'UVB', '파라-아미노벤조익애씨드', '파바']
p1_2 = []
p2_0 = []
p2_1 = []
p2_2 = []
p3_0 = ['페닐에틸레조시놀']
p3_1 = []
p3_2 = []
p4_0 = ['리조무코르 미에헤이추출물']
p4_1 = []
p4_2 = []
p5_0 = ['N-아세틸-L-타이로신', '기장', '기장추출물', '기장추출물', '다이리놀레익애씨드/프로판다이올코폴리머', '디하이드로에피안드로스테론', '라우릴락테이트', '로얄젤리', '리보오스', '망가니즈글루코네이트', '바나나추출물', '바이오틴', '사탕수수추출물', '서양고추나물꽃/잎/줄기추출물', '소듐하이드록시메칠글리시네이트', '쐐기풀', '쐐기풀추출물', '아이소말트', '아이소세틸살리케이트', '알코올', '와일드얌뿌리추출물', '요구르트', '프라스테론', '호르토니아 플로리분다잎추출물', '흉선하이드롤리세이트', '히페리쿰추출물']
p5_1 = ['실트', '씨솔트', '포포나무열매추출물', '포포추출물']
p5_2 = ['난', '난추출물', '비폴렌', '아와푸히', '아와푸히추출물', '토멘틸뿌리추출물', '토멘틸추출물']
p6_0 = ['알루미나', '알루미늄실리케이트', '탤크']
p6_1 = ['실트']
p6_2 = ['버지니아풍년화', '소듐카보네이트']
p7_0 = ['매스틱검']
p7_1 = []
p7_2 = []
p8_0 = ['리조무코르 미에헤이추출물']
p8_1 = ['파파야추출물']
p8_2 = ['파파인']
p9_0 = ['네틀추출물', '들깨', '루스쿠스 아쿨레아투스', '만주자작나무껍질추출물', '모창출뿌리추출물', '모하비유카', '모하비유카잎/뿌리/줄기추출물', '바나나추출물', '범부채뿌리추출물', '부처스브룸뿌리추출물', '사발팜열매추출물', '생강', '소시지트리추출물', '슬리퍼리엘름나무껍질', '슬리퍼리엘름나무껍질추출물', '쐐기풀', '쐐기풀추출물', '아줄렌', '요구르트', '유카추출물', '참갈파래추출물', '팬지추출물']
p9_1 = []
p9_2 = []
oily_bad = ["트라이글리세라이드","팔미틱애씨드","미리스틱애씨드","스테아릭애씨드","코코넛오일","시어버터","페트롤라툼",
          "벤조페논-3","메톡시신나메이트","에칠헥실메톡시신나메이트"]
dry_bad = ["알코올","암모늄라우릴설페이트","암모늄라우레스설페이트","소듐라우레스설페이트","멘톨","페퍼민트"]

class I_P: # Input_Problem
    
    def __init__(self, P_list, type_p):
        self.P_list = P_list
        self.type_p = type_p
        
    def c_p(self):
        print("Error")


class C_P(I_P): # Check_Problem
        
    def c_p(self):
        combine_p_list=[]
        
        for P0 in self.P_list:
            if P0 == '트러블성 피부 케어':
                combine_p_list.append(p0_0 + p0_1 + p0_2)
            elif P0 == '안티에이징':
                combine_p_list.append(p1_0 + p1_1 + p1_2)
            elif P0 == '블랙헤드 개선':
                combine_p_list.append(p2_0 + p2_1 + p2_2)
            elif P0 == '다크스팟 개선':
                combine_p_list.append(p3_0 + p3_1 + p3_2)
            elif P0 == '피부 톤 개선':
                combine_p_list.append(p4_0 + p4_1 + p4_2)
            elif P0 == '수분 공급':
                combine_p_list.append(p5_0 + p5_1 + p5_2)
            elif P0 == '유분 조절':
                combine_p_list.append(p6_0 + p6_1 + p6_2)
            elif P0 == '모공 크기 개선':
                combine_p_list.append(p7_0 + p7_1 + p7_2)
            elif P0 == '피부 요철 완화':
                combine_p_list.append(p8_0 + p8_1 + p8_2)
            elif P0 == '피부 진정':
                combine_p_list.append(p9_0 + p9_1 + p9_2)

        if self.type_p == '지성':
            combine_p_list.append(oily_bad)
        elif self.type_p == '건성':
            combine_p_list.append(dry_bad)
        
        combine_p_list = sum(combine_p_list, [])
        return combine_p_list


class C_G(I_P): # Check_Goods
        
    def c_g(self):
        combine_g_list=[]
        
        for P0 in self.P_list:
            if P0 == '트러블성 피부 케어':
                combine_g_list.append(g0_0 + g0_1)
            elif P0 == '안티에이징':
                combine_g_list.append(g1_0 + g1_1)
            elif P0 == '블랙헤드 개선':
                combine_g_list.append(g2_0 + g2_1)
            elif P0 == '다크스팟 개선':
                combine_g_list.append(g3_0 + g3_1)
            elif P0 == '피부 톤 개선':
                combine_g_list.append(g4_0 + g4_1)
            elif P0 == '수분 공급':
                combine_g_list.append(g5_0 + g5_1)
            elif P0 == '유분 조절':
                combine_g_list.append(g6_0 + g6_1)
            elif P0 == '모공 크기 개선':
                combine_g_list.append(g7_0 + g7_1)
            elif P0 == '피부 요철 완화':
                combine_g_list.append(g8_0 + g8_1)
            elif P0 == '피부 진정':
                combine_g_list.append(g9_0 + g9_1)

        if self.type_p == '지성':
            combine_g_list.append(oily_good)
        elif self.type_p == '건성':
            combine_g_list.append(dry_good)
            
        combine_g_list = sum(combine_g_list, [])
        return combine_g_list


class Custom_vec(I_P):
    
    def vec(self):
        self.g_0 = []
        self.g_1 = []
        
        for P0 in self.P_list:
            if P0 == '트러블성 피부 케어':
                self.g_0 += g0_0
                self.g_1 += g0_1

            elif P0 == '안티에이징':
                self.g_0 += g1_0
                self.g_1 += g1_1

            elif P0 == '블랙헤드 개선':
                self.g_0 += g2_0
                self.g_1 += g2_1

            elif P0 == '다크스팟 개선':
                self.g_0 += g3_0
                self.g_1 += g3_1

            elif P0 == '피부 톤 개선':
                self.g_0 += g4_0
                self.g_1 += g4_1

            elif P0 == '수분 공급':
                self.g_0 += g5_0
                self.g_1 += g5_1

            elif P0 == '유분 조절':
                self.g_0 += g6_0
                self.g_1 += g6_1

            elif P0 == '모공 크기 개선':
                self.g_0 += g7_0
                self.g_1 += g7_1

            elif P0 == '피부 요철 완화':
                self.g_0 += g8_0
                self.g_1 += g8_1

            elif P0 == '피부 진정':
                self.g_0 += g9_0
                self.g_1 += g9_1

        return self.g_0, self.g_1


class Recommend_search(I_P):
    
    def rec(self):
        self.p_0 = []
        self.p_1 = []
        self.p_2 = []
        type_p_list = []
        
        for P0 in self.P_list:
            if P0 == '트러블성 피부 케어':
                self.p_0 += p0_0
                self.p_1 += p0_1
                self.p_2 += p0_2
            elif P0 == '안티에이징':
                self.p_0 += p1_0
                self.p_1 += p1_1
                self.p_2 += p1_2
            elif P0 == '블랙헤드 개선':
                self.p_0 += p2_0
                self.p_1 += p2_1
                self.p_2 += p2_2
            elif P0 == '다크스팟 개선':
                self.p_0 += p3_0
                self.p_1 += p3_1
                self.p_2 += p3_2
            elif P0 == '피부 톤 개선':
                self.p_0 += p4_0
                self.p_1 += p4_1
                self.p_2 += p4_2
            elif P0 == '수분 공급':
                self.p_0 += p5_0
                self.p_1 += p5_1
                self.p_2 += p5_2
            elif P0 == '유분 조절':
                self.p_0 += p6_0
                self.p_1 += p6_1
                self.p_2 += p6_2
            elif P0 == '모공 크기 개선':
                self.p_0 += p7_0
                self.p_1 += p7_1
                self.p_2 += p7_2
            elif P0 == '피부 요철 완화':
                self.p_0 += p8_0
                self.p_1 += p8_1
                self.p_2 += p8_2
            elif P0 == '피부 진정':
                self.p_0 += p9_0
                self.p_1 += p9_1
                self.p_2 += p9_2
            
        if self.type_p == '지성':
            type_p_list = oily_bad

        elif self.type_p == '건성':
            type_p_list= dry_bad
                
        return self.p_0, self.p_1, self.p_2, type_p_list